# Flight Price Prediction [EDA and Feature Engineering]
Cleaning and preparing the data for Model Training

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn import preprocessing

## Importing Datasets

In [4]:
train_df = pd.read_excel("Data_Train.xlsx")
test_df = pd.read_excel('Test_set.xlsx')

In [5]:
train_df.head()

       Airline Date_of_Journey    Source  ... Total_Stops Additional_Info  Price
0       IndiGo      24/03/2019  Banglore  ...    non-stop         No info   3897
1    Air India       1/05/2019   Kolkata  ...     2 stops         No info   7662
2  Jet Airways       9/06/2019     Delhi  ...     2 stops         No info  13882
3       IndiGo      12/05/2019   Kolkata  ...      1 stop         No info   6218
4       IndiGo      01/03/2019  Banglore  ...      1 stop         No info  13302

[5 rows x 11 columns]

In [6]:
test_df.head()

             Airline Date_of_Journey  ... Total_Stops              Additional_Info
0        Jet Airways       6/06/2019  ...      1 stop                      No info
1             IndiGo      12/05/2019  ...      1 stop                      No info
2        Jet Airways      21/05/2019  ...      1 stop  In-flight meal not included
3  Multiple carriers      21/05/2019  ...      1 stop                      No info
4           Air Asia      24/06/2019  ...    non-stop                      No info

[5 rows x 10 columns]

In [7]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Date_of_Journey  10683 non-null  object
 2   Source           10683 non-null  object
 3   Destination      10683 non-null  object
 4   Route            10682 non-null  object
 5   Dep_Time         10683 non-null  object
 6   Arrival_Time     10683 non-null  object
 7   Duration         10683 non-null  object
 8   Total_Stops      10682 non-null  object
 9   Additional_Info  10683 non-null  object
 10  Price            10683 non-null  int64
dtypes: int64(1), object(10)
memory usage: 918.2+ KB

In [9]:
train_df['Source'].value_counts()

Source
Delhi       4537
Kolkata     2871
Banglore    2197
Mumbai       697
Chennai      381
Name: count, dtype: int64

In [14]:
train_df.shape

(10683, 11)

In [13]:
[feature for feature in train_df.columns if train_df[feature].isnull().sum() > 0]

['Route', 'Total_Stops']

In [15]:
test_df.shape

(2671, 10)

In [12]:
[feature for feature in test_df.columns if test_df[feature].isnull().sum() > 0]

[]

## Combining both train data and test data

In [105]:
df = pd.concat([train_df,test_df], ignore_index= True)

In [106]:
df.head()

       Airline Date_of_Journey    Source  ... Total_Stops Additional_Info    Price
0       IndiGo      24/03/2019  Banglore  ...    non-stop         No info   3897.0
1    Air India       1/05/2019   Kolkata  ...     2 stops         No info   7662.0
2  Jet Airways       9/06/2019     Delhi  ...     2 stops         No info  13882.0
3       IndiGo      12/05/2019   Kolkata  ...      1 stop         No info   6218.0
4       IndiGo      01/03/2019  Banglore  ...      1 stop         No info  13302.0

[5 rows x 11 columns]

In [107]:
df.tail()

                 Airline Date_of_Journey  ... Additional_Info Price
13349          Air India       6/06/2019  ...         No info   NaN
13350             IndiGo      27/03/2019  ...         No info   NaN
13351        Jet Airways       6/03/2019  ...         No info   NaN
13352          Air India       6/03/2019  ...         No info   NaN
13353  Multiple carriers      15/06/2019  ...         No info   NaN

[5 rows x 11 columns]

In [108]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13354 entries, 0 to 13353
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13354 non-null  object
 1   Date_of_Journey  13354 non-null  object
 2   Source           13354 non-null  object
 3   Destination      13354 non-null  object
 4   Route            13353 non-null  object
 5   Dep_Time         13354 non-null  object
 6   Arrival_Time     13354 non-null  object
 7   Duration         13354 non-null  object
 8   Total_Stops      13353 non-null  object
 9   Additional_Info  13354 non-null  object
 10  Price            10683 non-null  float64
dtypes: float64(1), object(10)
memory usage: 1.1+ MB

In [109]:
df.describe()

              Price
count  10683.000000
mean    9087.064121
std     4611.359167
min     1759.000000
25%     5277.000000
50%     8372.000000
75%    12373.000000
max    79512.000000

In [110]:
df[df['Additional_Info'] == 'No Info']['Additional_Info'] = "No info"

C:\Users\Avinash\AppData\Local\Temp\ipykernel_11412\1929292065.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[df['Additional_Info'] == 'No Info']['Additional_Info'] = "No info"

In [111]:
df.loc[df['Additional_Info'] == 'No Info', 'Additional_Info'] = "No info"

In [112]:
df['Additional_Info'].value_counts()

Additional_Info
No info                         10496
In-flight meal not included      2426
No check-in baggage included      396
1 Long layover                     20
Change airports                     8
Business class                      5
1 Short layover                     1
Red-eye flight                      1
2 Long layover                      1
Name: count, dtype: int64

In [113]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13354 entries, 0 to 13353
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13354 non-null  object
 1   Date_of_Journey  13354 non-null  object
 2   Source           13354 non-null  object
 3   Destination      13354 non-null  object
 4   Route            13353 non-null  object
 5   Dep_Time         13354 non-null  object
 6   Arrival_Time     13354 non-null  object
 7   Duration         13354 non-null  object
 8   Total_Stops      13353 non-null  object
 9   Additional_Info  13354 non-null  object
 10  Price            10683 non-null  float64
dtypes: float64(1), object(10)
memory usage: 1.1+ MB

## Converting Data into required Format

### Date_of_Journey

In [114]:
df['Date_of_Journey'].str.split("/")

0        [24, 03, 2019]
1         [1, 05, 2019]
2         [9, 06, 2019]
3        [12, 05, 2019]
4        [01, 03, 2019]
              ...
13349     [6, 06, 2019]
13350    [27, 03, 2019]
13351     [6, 03, 2019]
13352     [6, 03, 2019]
13353    [15, 06, 2019]
Name: Date_of_Journey, Length: 13354, dtype: object

In [115]:
df['Date_of_Journey'].str.split("/").str[0]

0        24
1         1
2         9
3        12
4        01
         ..
13349     6
13350    27
13351     6
13352     6
13353    15
Name: Date_of_Journey, Length: 13354, dtype: object

In [116]:
df['Date'] = df['Date_of_Journey'].str.split("/").str[0]
df['Month'] = df['Date_of_Journey'].str.split("/").str[1]
df['Year'] = df['Date_of_Journey'].apply(lambda x: x.split('/')[2])

In [117]:
df.tail()

                 Airline Date_of_Journey   Source  ... Date Month  Year
13349          Air India       6/06/2019  Kolkata  ...    6    06  2019
13350             IndiGo      27/03/2019  Kolkata  ...   27    03  2019
13351        Jet Airways       6/03/2019    Delhi  ...    6    03  2019
13352          Air India       6/03/2019    Delhi  ...    6    03  2019
13353  Multiple carriers      15/06/2019    Delhi  ...   15    06  2019

[5 rows x 14 columns]

In [118]:
df['Date'] = df['Date'].astype(int)
df['Month'] = df['Month'].astype(int)
df['Year'] = df['Year'].astype(int)

In [119]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13354 entries, 0 to 13353
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13354 non-null  object
 1   Date_of_Journey  13354 non-null  object
 2   Source           13354 non-null  object
 3   Destination      13354 non-null  object
 4   Route            13353 non-null  object
 5   Dep_Time         13354 non-null  object
 6   Arrival_Time     13354 non-null  object
 7   Duration         13354 non-null  object
 8   Total_Stops      13353 non-null  object
 9   Additional_Info  13354 non-null  object
 10  Price            10683 non-null  float64
 11  Date             13354 non-null  int64
 12  Month            13354 non-null  int64
 13  Year             13354 non-null  int64
dtypes: float64(1), int64(3), object(10)
memory usage: 1.4+ MB

In [120]:
df.drop('Date_of_Journey', axis= 1, inplace= True)

### Route

In [121]:
df['Route']

0                    BLR → DEL
1        CCU → IXR → BBI → BLR
2        DEL → LKO → BOM → COK
3              CCU → NAG → BLR
4              BLR → NAG → DEL
                 ...
13349          CCU → DEL → BLR
13350                CCU → BLR
13351          DEL → BOM → COK
13352          DEL → BOM → COK
13353          DEL → BOM → COK
Name: Route, Length: 13354, dtype: object

In [122]:
df['Total_Stops'].unique()

array(['non-stop', '2 stops', '1 stop', '3 stops', nan, '4 stops'],
      dtype=object)

In [123]:
df[df['Total_Stops'].isnull()]

        Airline Source Destination Route  ...   Price Date Month  Year
9039  Air India  Delhi      Cochin   NaN  ...  7480.0    6     5  2019

[1 rows x 13 columns]

In [124]:
#target ordinal encoding

df['Total_Stops'] = df['Total_Stops'].map({'non-stop' : 0, '1 stop' : 1, '2 stops' : 2, '3 stops' : 3, '4 stops' : 4, 'nan' : 2})

In [125]:
df["Total_Stops"]

0        0.0
1        2.0
2        2.0
3        1.0
4        1.0
        ...
13349    1.0
13350    0.0
13351    1.0
13352    1.0
13353    1.0
Name: Total_Stops, Length: 13354, dtype: float64

In [126]:
df.drop('Route', axis= 1, inplace= True)

In [127]:
df.head()

       Airline    Source Destination Dep_Time  ...    Price Date  Month  Year
0       IndiGo  Banglore   New Delhi    22:20  ...   3897.0   24      3  2019
1    Air India   Kolkata    Banglore    05:50  ...   7662.0    1      5  2019
2  Jet Airways     Delhi      Cochin    09:25  ...  13882.0    9      6  2019
3       IndiGo   Kolkata    Banglore    18:05  ...   6218.0   12      5  2019
4       IndiGo  Banglore   New Delhi    16:50  ...  13302.0    1      3  2019

[5 rows x 12 columns]

### Arrival and Departure

In [128]:
df['Arrival_Time'] = df['Arrival_Time'].apply(lambda x: x.split(" ")[0])

In [129]:
df['Arrival_Time'].

SyntaxError: invalid syntax (2812422230.py, line 1)

In [130]:
df['Arrival_hour'] = df['Arrival_Time'].str.split(':').str[0].astype(int)
df['Arrival_minute'] = df['Arrival_Time'].str.split(':').str[1].astype(int)

In [131]:
df.head()

       Airline    Source Destination  ...  Year Arrival_hour Arrival_minute
0       IndiGo  Banglore   New Delhi  ...  2019            1             10
1    Air India   Kolkata    Banglore  ...  2019           13             15
2  Jet Airways     Delhi      Cochin  ...  2019            4             25
3       IndiGo   Kolkata    Banglore  ...  2019           23             30
4       IndiGo  Banglore   New Delhi  ...  2019           21             35

[5 rows x 14 columns]

In [132]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13354 entries, 0 to 13353
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13354 non-null  object
 1   Source           13354 non-null  object
 2   Destination      13354 non-null  object
 3   Dep_Time         13354 non-null  object
 4   Arrival_Time     13354 non-null  object
 5   Duration         13354 non-null  object
 6   Total_Stops      13353 non-null  float64
 7   Additional_Info  13354 non-null  object
 8   Price            10683 non-null  float64
 9   Date             13354 non-null  int64
 10  Month            13354 non-null  int64
 11  Year             13354 non-null  int64
 12  Arrival_hour     13354 non-null  int64
 13  Arrival_minute   13354 non-null  int64
dtypes: float64(2), int64(5), object(7)
memory usage: 1.4+ MB

In [133]:
df.drop('Arrival_Time', axis= 1, inplace= True)

In [134]:
df['Dep_Time'] = df['Dep_Time'].apply(lambda x: x.split(" ")[0])

In [135]:
df['Departure_hour'] = df['Dep_Time'].apply(lambda x : x.split(":")[0]).astype(int)
df['Departure_minute'] = df['Dep_Time'].apply(lambda x : x.split(":")[1]).astype(int)

In [136]:
df.head()

       Airline    Source  ... Departure_hour Departure_minute
0       IndiGo  Banglore  ...             22               20
1    Air India   Kolkata  ...              5               50
2  Jet Airways     Delhi  ...              9               25
3       IndiGo   Kolkata  ...             18                5
4       IndiGo  Banglore  ...             16               50

[5 rows x 15 columns]

In [137]:
df.drop('Dep_Time', axis= 1, inplace= True)

In [138]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13354 entries, 0 to 13353
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Airline           13354 non-null  object
 1   Source            13354 non-null  object
 2   Destination       13354 non-null  object
 3   Duration          13354 non-null  object
 4   Total_Stops       13353 non-null  float64
 5   Additional_Info   13354 non-null  object
 6   Price             10683 non-null  float64
 7   Date              13354 non-null  int64
 8   Month             13354 non-null  int64
 9   Year              13354 non-null  int64
 10  Arrival_hour      13354 non-null  int64
 11  Arrival_minute    13354 non-null  int64
 12  Departure_hour    13354 non-null  int64
 13  Departure_minute  13354 non-null  int64
dtypes: float64(2), int64(7), object(5)
memory usage: 1.4+ MB

### Duration

In [146]:
df['hours'] = df['Duration'].str.replace('h', '').str.replace('m', '').str.split().str[0]
df['min'] = df['Duration'].str.replace('h', '').str.replace('m', '').str.split().str[1]

In [152]:
df.loc[df['min'].isnull(), 'min'] = 0

In [155]:
df['hours'] = df['hours'].astype(int)
df['min'] = df['min'].astype(int)

In [158]:
df['Duration'] = df['hours'] * 60 + df['min']

In [159]:
df['Duration']

0         170
1         445
2        1140
3         325
4         285
         ...
13349    1435
13350     155
13351     395
13352     915
13353     860
Name: Duration, Length: 13354, dtype: int64

In [161]:
df.drop('duration_min', axis= 1, inplace= True)

df.drop('min', axis= 1, inplace= True)
df.drop('hours', axis= 1, inplace= True)

In [170]:
df[(df['Source'] == 'Mumbai') & (df['Destination'] == 'Hyderabad')]

           Airline  Source  ... Departure_hour  Departure_minute
59         Vistara  Mumbai  ...             15                40
67       Air India  Mumbai  ...             13                55
70     Jet Airways  Mumbai  ...              7                 5
77          IndiGo  Mumbai  ...              6                25
98     Jet Airways  Mumbai  ...              7                 5
...            ...     ...  ...            ...               ...
13292     SpiceJet  Mumbai  ...              5                45
13315  Jet Airways  Mumbai  ...              2                55
13343    Air India  Mumbai  ...             16                50
13345    Air India  Mumbai  ...             13                55
13348     SpiceJet  Mumbai  ...             22                45

[883 rows x 14 columns]

## Converting Categorical to Numerical

### Handling Airline, Source, Destination, Additional_Info

In [47]:
df['Airline'].unique()

array(['IndiGo', 'Air India', 'Jet Airways', 'SpiceJet',
       'Multiple carriers', 'GoAir', 'Vistara', 'Air Asia',
       'Vistara Premium economy', 'Jet Airways Business',
       'Multiple carriers Premium economy', 'Trujet'], dtype=object)

In [172]:
df['Source'].unique()

array(['Banglore', 'Kolkata', 'Delhi', 'Chennai', 'Mumbai'], dtype=object)

In [173]:
df['Destination'].unique()

array(['New Delhi', 'Banglore', 'Cochin', 'Kolkata', 'Delhi', 'Hyderabad'],
      dtype=object)

In [175]:
df['Additional_Info'].unique()

array(['No info', 'In-flight meal not included',
       'No check-in baggage included', '1 Short layover',
       '1 Long layover', 'Change airports', 'Business class',
       'Red-eye flight', '2 Long layover'], dtype=object)

In [171]:
labelEncoder = preprocessing.LabelEncoder()

In [176]:
df['Airline'] = labelEncoder.fit_transform(df['Airline'])
df['Source'] = labelEncoder.fit_transform(df['Source'])
df['Destination'] = labelEncoder.fit_transform(df['Destination'])
df['Additional_Info'] = labelEncoder.fit_transform(df['Additional_Info'])

In [178]:
df.shape

(13354, 14)